var rule = {
    author: '自由/251021',
    title: '网飞猫影视',
    类型: '影视',
    host: 'https://www.fjszjm.com',
    hostJs: ``,
    headers: {
        'User-Agent': 'MOBILE_UA'
    },
    编码: 'utf-8',
    timeout: 5000,
    homeUrl: 'https://www.fjszjm.com',
    url: 'https://www.fjszjm.com/wfmwusw/fyfilter.html',
    filter_url: '{{fl.cateId}}-{{fl.area}}---{{fl.lang}}-{{fl.letter}}---fypage---{{fl.year}}',
    detailUrl: 'http://www.hemayes.com/ccernr/fyid.html',
    searchUrl: 'https://www.fjszjm.com/wfmwusc/**----------fypage---.html',

    搜索: '*',
    searchable: 1,
    quickSearch: 1,
    filterable: 1,
    limit: 10,
    double: false,
    class_name: '电影&电视剧&动漫&综艺&短剧',
    class_url: '1&2&4&3&5',
    filter_def: {
        1: {
            cateId: '1'
        },
        2: {
            cateId: '2'
        },
        4: {
            cateId: '4'
        },
        3: {
            cateId: '3'
        },
        5: {
            cateId: '5'
        },
    },

    推荐: '*',
    一级: '.stui-vodlist__thumb.lazyload;a&&title;a&&data-original;.pic-text.text-right&&Text;a&&href',

    二级: $js.toString(() => {
        let html = request(input);
        VOD = {};
        VOD.vod_id = input;
        VOD.vod_name = pdfh(html, 'h1&&Text');
        VOD.type_name = pdfh(html, 'p:contains(类型)&&Text').replace('类型：', '');
        VOD.vod_pic = pd(html, '.lazyload&&data-original', input);
        VOD.vod_remarks = pdfh(html, 'p:contains(状态)&&Text').replace('状态：', '');
        VOD.vod_director = pdfh(html, 'p:contains(导演)&&Text').replace('导演：', '');
        VOD.vod_actor = pdfh(html, 'p:contains(主演)&&Text').replace('主演：', '');
        VOD.vod_content = '【友情提醒：请不要相信视频中的广告，以免上当受骗！】✨乐哥为您介绍剧情👉' + pdfh(html, 'p:contains(简介)&&Text').replace('简介：', '');

        let r_ktabs = pdfa(html, '.nav&&li');
        let ktabs = r_ktabs.map(it => pdfh(it, 'a&&Text'));
        VOD.vod_play_from = ktabs.join('$$$');        
        let klists = [];
        let r_plists = pdfa(html, '.stui-content__playlist');
        r_plists.forEach((rp) => {
            let klist = pdfa(rp, 'li')
                .filter(it => !pdfh(it, 'a&&Text').includes('дрр滈凊'))
                .map(it => pdfh(it, 'a&&Text').trim() + '$' + pd(it, 'a&&href', input));
            klists.push(klist.join('#'));
        });
        VOD.vod_play_url = klists.join('$$$')
    }),
    sniffer: 0,
    isVideo: 'http((?!http).){26,}\\.(m3u8|mp4|flv|avi|mkv|wmv|mpg|mpeg|mov|ts|3gp|rm|rmvb|asf|m4a|mp3|wma)',
    play_parse: true,

    lazy: $js.toString(() => {
        let kcode = JSON.parse(fetch(input).split('aaaa=')[1].split('<')[0]);
        let kurl = kcode.url;
        if (/\.(m3u8|mp4)/.test(kurl)) {
            input = {
                jx: 0,
                parse: 0,
                url: kurl,
                header: {
                    'User-Agent': MOBILE_UA,
                    'Referer': getHome(kurl)
                }
            }
        } else {
            input = {
                jx: 0,
                parse: 1,
                url: input
            }
        }
    }),

    filter: {
        "1": [{
                "key": "cateId",
                "name": "类型",
                "value": [{
                        "n": "全部",
                        "v": "1"
                    },
                    {
                        "n": "动作片",
                        "v": "6"
                    },
                    {
                        "n": "喜剧片",
                        "v": "7"
                    },
                    {
                        "n": "爱情片",
                        "v": "8"
                    },
                    {
                        "n": "科幻片",
                        "v": "9"
                    },
                    {
                        "n": "恐怖片",
                        "v": "10"
                    },
                    {
                        "n": "剧情片",
                        "v": "11"
                    },
                    {
                        "n": "战争片",
                        "v": "12"
                    },
                    {
                        "n": "纪录片",
                        "v": "13"
                    },
                    {
                        "n": "悬疑片",
                        "v": "14"
                    },
                    {
                        "n": "犯罪片",
                        "v": "15"
                    },
                    {
                        "n": "奇幻片",
                        "v": "16"
                    },
                    {
                        "n": "动画片",
                        "v": "31"
                    },
                    {
                        "n": "预告片",
                        "v": "32"
                    }
                ]
            },

            {
                "key": "area",
                "name": "地区",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "大陆",
                        "v": "大陆"
                    },
                    {
                        "n": "香港",
                        "v": "香港"
                    },
                    {
                        "n": "台湾",
                        "v": "台湾"
                    },
                    {
                        "n": "美国",
                        "v": "美国"
                    },
                    {
                        "n": "法国",
                        "v": "法国"
                    },
                    {
                        "n": "英国",
                        "v": "英国"
                    },
                    {
                        "n": "日本",
                        "v": "日本"
                    },
                    {
                        "n": "韩国",
                        "v": "韩国"
                    },
                    {
                        "n": "德国",
                        "v": "德国"
                    },
                    {
                        "n": "泰国",
                        "v": "泰国"
                    },
                    {
                        "n": "印度",
                        "v": "印度"
                    },
                    {
                        "n": "意大利",
                        "v": "意大利"
                    },
                    {
                        "n": "西班牙",
                        "v": "西班牙"
                    },
                    {
                        "n": "加拿大",
                        "v": "加拿大"
                    },
                    {
                        "n": "其他",
                        "v": "其他"
                    }
                ]



            },

            {
                "key": "year",
                "name": "年份",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "2025",
                        "v": "2025"
                    },
                    {
                        "n": "2024",
                        "v": "2024"
                    },
                    {
                        "n": "2023",
                        "v": "2023"
                    },
                    {
                        "n": "2022",
                        "v": "2022"
                    },
                    {
                        "n": "2021",
                        "v": "2021"
                    },
                    {
                        "n": "2020",
                        "v": "2020"
                    },
                    {
                        "n": "2019",
                        "v": "2019"
                    },
                    {
                        "n": "2018",
                        "v": "2018"
                    },
                    {
                        "n": "2017",
                        "v": "2017"
                    },
                    {
                        "n": "2016",
                        "v": "2016"
                    },
                    {
                        "n": "2015",
                        "v": "2015"
                    },
                    {
                        "n": "2014",
                        "v": "2014"
                    },
                    {
                        "n": "2013",
                        "v": "2013"
                    },
                    {
                        "n": "2012",
                        "v": "2012"
                    },
                    {
                        "n": "2011",
                        "v": "2011"
                    },
                    {
                        "n": "2010",
                        "v": "2010"
                    },
                    {
                        "n": "2009",
                        "v": "2009"
                    },
                    {
                        "n": "2008",
                        "v": "2008"
                    },
                    {
                        "n": "2007",
                        "v": "2007"
                    },
                    {
                        "n": "2006",
                        "v": "2006"
                    },
                    {
                        "n": "2005",
                        "v": "2005"
                    },
                    {
                        "n": "2004",
                        "v": "2004"
                    },
                    {
                        "n": "2003",
                        "v": "2003"
                    },
                    {
                        "n": "2002",
                        "v": "2002"
                    },
                    {
                        "n": "2001",
                        "v": "2001"
                    },
                    {
                        "n": "2000",
                        "v": "2000"
                    },
                    {
                        "n": "1999",
                        "v": "1999"
                    },
                    {
                        "n": "1998",
                        "v": "1998"
                    },
                    {
                        "n": "1997",
                        "v": "1997"
                    },
                    {
                        "n": "1996",
                        "v": "1996"
                    },
                    {
                        "n": "1995",
                        "v": "1995"
                    },
                    {
                        "n": "1994",
                        "v": "1994"
                    },
                    {
                        "n": "1993",
                        "v": "1993"
                    },
                    {
                        "n": "1992",
                        "v": "1992"
                    },
                    {
                        "n": "1991",
                        "v": "1991"
                    },
                    {
                        "n": "1990",
                        "v": "1990"
                    },
                    {
                        "n": "1989",
                        "v": "1989"
                    },
                    {
                        "n": "1988",
                        "v": "1988"
                    },
                    {
                        "n": "1987",
                        "v": "1987"
                    },
                    {
                        "n": "1986",
                        "v": "1986"
                    },
                    {
                        "n": "1985",
                        "v": "1985"
                    },
                    {
                        "n": "1984",
                        "v": "1984"
                    },
                    {
                        "n": "1983",
                        "v": "1983"
                    },
                    {
                        "n": "1982",
                        "v": "1982"
                    },
                    {
                        "n": "1981",
                        "v": "1981"
                    },
                    {
                        "n": "1980",
                        "v": "1980"
                    },
                    {
                        "n": "1979",
                        "v": "1979"
                    },
                    {
                        "n": "1978",
                        "v": "1978"
                    },
                    {
                        "n": "1977",
                        "v": "1977"
                    },
                    {
                        "n": "1976",
                        "v": "1976"
                    },
                    {
                        "n": "1975",
                        "v": "1975"
                    },
                    {
                        "n": "1974",
                        "v": "1974"
                    },
                    {
                        "n": "1973",
                        "v": "1973"
                    },
                    {
                        "n": "1972",
                        "v": "1972"
                    },
                    {
                        "n": "1971",
                        "v": "1971"
                    },
                    {
                        "n": "1970",
                        "v": "1970"
                    }
                ]

            },


            {
                "key": "lang",
                "name": "语言",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "国语",
                        "v": "国语"
                    },
                    {
                        "n": "英语",
                        "v": "英语"
                    },
                    {
                        "n": "粤语",
                        "v": "粤语"
                    },
                    {
                        "n": "闽南语",
                        "v": "闽南语"
                    },
                    {
                        "n": "韩语",
                        "v": "韩语"
                    },
                    {
                        "n": "日语",
                        "v": "日语"
                    },
                    {
                        "n": "法语",
                        "v": "法语"
                    },
                    {
                        "n": "德语",
                        "v": "德语"
                    },
                    {
                        "n": "其它",
                        "v": "其它"
                    }
                ]

            },


            {
                "key": "letter",
                "name": "字母",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "A",
                        "v": "A"
                    },
                    {
                        "n": "B",
                        "v": "B"
                    },
                    {
                        "n": "C",
                        "v": "C"
                    },
                    {
                        "n": "D",
                        "v": "D"
                    },
                    {
                        "n": "E",
                        "v": "E"
                    },
                    {
                        "n": "F",
                        "v": "F"
                    },
                    {
                        "n": "G",
                        "v": "G"
                    },
                    {
                        "n": "H",
                        "v": "H"
                    },
                    {
                        "n": "I",
                        "v": "I"
                    },
                    {
                        "n": "J",
                        "v": "J"
                    },
                    {
                        "n": "K",
                        "v": "K"
                    },
                    {
                        "n": "L",
                        "v": "L"
                    },
                    {
                        "n": "M",
                        "v": "M"
                    },
                    {
                        "n": "N",
                        "v": "N"
                    },
                    {
                        "n": "O",
                        "v": "O"
                    },
                    {
                        "n": "P",
                        "v": "P"
                    },
                    {
                        "n": "Q",
                        "v": "Q"
                    },
                    {
                        "n": "R",
                        "v": "R"
                    },
                    {
                        "n": "S",
                        "v": "S"
                    },
                    {
                        "n": "T",
                        "v": "T"
                    },
                    {
                        "n": "U",
                        "v": "U"
                    },
                    {
                        "n": "V",
                        "v": "V"
                    },
                    {
                        "n": "W",
                        "v": "W"
                    },
                    {
                        "n": "X",
                        "v": "X"
                    },
                    {
                        "n": "Y",
                        "v": "Y"
                    },
                    {
                        "n": "Z",
                        "v": "Z"
                    },
                    {
                        "n": "0-9",
                        "v": "0-9"
                    }
                ]


            }
        ],
        "2": [



            {
                "key": "cateId",
                "name": "类型",
                "value": [{
                        "n": "全部",
                        "v": "2"
                    },
                    {
                        "n": "国产剧",
                        "v": "17"
                    },
                    {
                        "n": "港台剧",
                        "v": "18"
                    },
                    {
                        "n": "日韩剧",
                        "v": "20"
                    },
                    {
                        "n": "欧美剧",
                        "v": "21"
                    },
                    {
                        "n": "海外剧",
                        "v": "22"
                    }
                ]


            },

            {
                "key": "area",
                "name": "地区",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "内地",
                        "v": "内地"
                    },
                    {
                        "n": "韩国",
                        "v": "韩国"
                    },
                    {
                        "n": "香港",
                        "v": "香港"
                    },
                    {
                        "n": "台湾",
                        "v": "台湾"
                    },
                    {
                        "n": "日本",
                        "v": "日本"
                    },
                    {
                        "n": "美国",
                        "v": "美国"
                    },
                    {
                        "n": "泰国",
                        "v": "泰国"
                    },
                    {
                        "n": "英国",
                        "v": "英国"
                    },
                    {
                        "n": "新加坡",
                        "v": "新加坡"
                    },
                    {
                        "n": "其他",
                        "v": "其他"
                    }
                ]




            },

            {
                "key": "year",
                "name": "年份",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "2025",
                        "v": "2025"
                    },
                    {
                        "n": "2024",
                        "v": "2024"
                    },
                    {
                        "n": "2023",
                        "v": "2023"
                    },
                    {
                        "n": "2022",
                        "v": "2022"
                    },
                    {
                        "n": "2021",
                        "v": "2021"
                    },
                    {
                        "n": "2020",
                        "v": "2020"
                    },
                    {
                        "n": "2019",
                        "v": "2019"
                    },
                    {
                        "n": "2018",
                        "v": "2018"
                    },
                    {
                        "n": "2017",
                        "v": "2017"
                    },
                    {
                        "n": "2016",
                        "v": "2016"
                    },
                    {
                        "n": "2015",
                        "v": "2015"
                    },
                    {
                        "n": "2014",
                        "v": "2014"
                    },
                    {
                        "n": "2013",
                        "v": "2013"
                    },
                    {
                        "n": "2012",
                        "v": "2012"
                    },
                    {
                        "n": "2011",
                        "v": "2011"
                    },
                    {
                        "n": "2010",
                        "v": "2010"
                    },
                    {
                        "n": "2009",
                        "v": "2009"
                    },
                    {
                        "n": "2008",
                        "v": "2008"
                    },
                    {
                        "n": "2007",
                        "v": "2007"
                    },
                    {
                        "n": "2006",
                        "v": "2006"
                    },
                    {
                        "n": "2005",
                        "v": "2005"
                    },
                    {
                        "n": "2004",
                        "v": "2004"
                    },
                    {
                        "n": "2003",
                        "v": "2003"
                    },
                    {
                        "n": "2002",
                        "v": "2002"
                    },
                    {
                        "n": "2001",
                        "v": "2001"
                    },
                    {
                        "n": "2000",
                        "v": "2000"
                    },
                    {
                        "n": "1999",
                        "v": "1999"
                    },
                    {
                        "n": "1998",
                        "v": "1998"
                    },
                    {
                        "n": "1997",
                        "v": "1997"
                    },
                    {
                        "n": "1996",
                        "v": "1996"
                    },
                    {
                        "n": "1995",
                        "v": "1995"
                    },
                    {
                        "n": "1994",
                        "v": "1994"
                    },
                    {
                        "n": "1993",
                        "v": "1993"
                    },
                    {
                        "n": "1992",
                        "v": "1992"
                    },
                    {
                        "n": "1991",
                        "v": "1991"
                    },
                    {
                        "n": "1990",
                        "v": "1990"
                    },
                    {
                        "n": "1989",
                        "v": "1989"
                    },
                    {
                        "n": "1988",
                        "v": "1988"
                    },
                    {
                        "n": "1987",
                        "v": "1987"
                    },
                    {
                        "n": "1986",
                        "v": "1986"
                    },
                    {
                        "n": "1985",
                        "v": "1985"
                    },
                    {
                        "n": "1984",
                        "v": "1984"
                    },
                    {
                        "n": "1983",
                        "v": "1983"
                    },
                    {
                        "n": "1982",
                        "v": "1982"
                    },
                    {
                        "n": "1981",
                        "v": "1981"
                    },
                    {
                        "n": "1980",
                        "v": "1980"
                    },
                    {
                        "n": "1979",
                        "v": "1979"
                    },
                    {
                        "n": "1978",
                        "v": "1978"
                    },
                    {
                        "n": "1977",
                        "v": "1977"
                    },
                    {
                        "n": "1976",
                        "v": "1976"
                    },
                    {
                        "n": "1975",
                        "v": "1975"
                    },
                    {
                        "n": "1974",
                        "v": "1974"
                    },
                    {
                        "n": "1973",
                        "v": "1973"
                    },
                    {
                        "n": "1972",
                        "v": "1972"
                    },
                    {
                        "n": "1971",
                        "v": "1971"
                    },
                    {
                        "n": "1970",
                        "v": "1970"
                    }
                ]

            },


            {
                "key": "lang",
                "name": "语言",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "国语",
                        "v": "国语"
                    },
                    {
                        "n": "英语",
                        "v": "英语"
                    },
                    {
                        "n": "粤语",
                        "v": "粤语"
                    },
                    {
                        "n": "闽南语",
                        "v": "闽南语"
                    },
                    {
                        "n": "韩语",
                        "v": "韩语"
                    },
                    {
                        "n": "日语",
                        "v": "日语"
                    },
                    {
                        "n": "法语",
                        "v": "法语"
                    },
                    {
                        "n": "德语",
                        "v": "德语"
                    },
                    {
                        "n": "其它",
                        "v": "其它"
                    }
                ]

            },


            {
                "key": "letter",
                "name": "字母",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "A",
                        "v": "A"
                    },
                    {
                        "n": "B",
                        "v": "B"
                    },
                    {
                        "n": "C",
                        "v": "C"
                    },
                    {
                        "n": "D",
                        "v": "D"
                    },
                    {
                        "n": "E",
                        "v": "E"
                    },
                    {
                        "n": "F",
                        "v": "F"
                    },
                    {
                        "n": "G",
                        "v": "G"
                    },
                    {
                        "n": "H",
                        "v": "H"
                    },
                    {
                        "n": "I",
                        "v": "I"
                    },
                    {
                        "n": "J",
                        "v": "J"
                    },
                    {
                        "n": "K",
                        "v": "K"
                    },
                    {
                        "n": "L",
                        "v": "L"
                    },
                    {
                        "n": "M",
                        "v": "M"
                    },
                    {
                        "n": "N",
                        "v": "N"
                    },
                    {
                        "n": "O",
                        "v": "O"
                    },
                    {
                        "n": "P",
                        "v": "P"
                    },
                    {
                        "n": "Q",
                        "v": "Q"
                    },
                    {
                        "n": "R",
                        "v": "R"
                    },
                    {
                        "n": "S",
                        "v": "S"
                    },
                    {
                        "n": "T",
                        "v": "T"
                    },
                    {
                        "n": "U",
                        "v": "U"
                    },
                    {
                        "n": "V",
                        "v": "V"
                    },
                    {
                        "n": "W",
                        "v": "W"
                    },
                    {
                        "n": "X",
                        "v": "X"
                    },
                    {
                        "n": "Y",
                        "v": "Y"
                    },
                    {
                        "n": "Z",
                        "v": "Z"
                    },
                    {
                        "n": "0-9",
                        "v": "0-9"
                    }
                ]


            }


        ],

        "4": [

            {
                "key": "cateId",
                "name": "类型",
                "value":

                    [{
                            "n": "全部",
                            "v": "4"
                        },
                        {
                            "n": "国产动漫",
                            "v": "27"
                        },
                        {
                            "n": "日韩动漫",
                            "v": "28"
                        },
                        {
                            "n": "欧美动漫",
                            "v": "29"
                        },
                        {
                            "n": "其他动漫",
                            "v": "30"
                        }

                    ]

            },

            {
                "key": "area",
                "name": "地区",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "国产",
                        "v": "国产"
                    },
                    {
                        "n": "日本",
                        "v": "日本"
                    },
                    {
                        "n": "欧美",
                        "v": "欧美"
                    },
                    {
                        "n": "其他",
                        "v": "其他"
                    }
                ]
            },

            {
                "key": "year",
                "name": "年份",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "2025",
                        "v": "2025"
                    },
                    {
                        "n": "2024",
                        "v": "2024"
                    },
                    {
                        "n": "2023",
                        "v": "2023"
                    },
                    {
                        "n": "2022",
                        "v": "2022"
                    },
                    {
                        "n": "2021",
                        "v": "2021"
                    },
                    {
                        "n": "2020",
                        "v": "2020"
                    },
                    {
                        "n": "2019",
                        "v": "2019"
                    },
                    {
                        "n": "2018",
                        "v": "2018"
                    },
                    {
                        "n": "2017",
                        "v": "2017"
                    },
                    {
                        "n": "2016",
                        "v": "2016"
                    },
                    {
                        "n": "2015",
                        "v": "2015"
                    }
                ]

            },


            {
                "key": "lang",
                "name": "语言",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "国语",
                        "v": "国语"
                    },
                    {
                        "n": "英语",
                        "v": "英语"
                    },
                    {
                        "n": "粤语",
                        "v": "粤语"
                    },
                    {
                        "n": "闽南语",
                        "v": "闽南语"
                    },
                    {
                        "n": "韩语",
                        "v": "韩语"
                    },
                    {
                        "n": "日语",
                        "v": "日语"
                    },
                    {
                        "n": "法语",
                        "v": "法语"
                    },
                    {
                        "n": "德语",
                        "v": "德语"
                    },
                    {
                        "n": "其它",
                        "v": "其它"
                    }
                ]

            },


            {
                "key": "letter",
                "name": "字母",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "A",
                        "v": "A"
                    },
                    {
                        "n": "B",
                        "v": "B"
                    },
                    {
                        "n": "C",
                        "v": "C"
                    },
                    {
                        "n": "D",
                        "v": "D"
                    },
                    {
                        "n": "E",
                        "v": "E"
                    },
                    {
                        "n": "F",
                        "v": "F"
                    },
                    {
                        "n": "G",
                        "v": "G"
                    },
                    {
                        "n": "H",
                        "v": "H"
                    },
                    {
                        "n": "I",
                        "v": "I"
                    },
                    {
                        "n": "J",
                        "v": "J"
                    },
                    {
                        "n": "K",
                        "v": "K"
                    },
                    {
                        "n": "L",
                        "v": "L"
                    },
                    {
                        "n": "M",
                        "v": "M"
                    },
                    {
                        "n": "N",
                        "v": "N"
                    },
                    {
                        "n": "O",
                        "v": "O"
                    },
                    {
                        "n": "P",
                        "v": "P"
                    },
                    {
                        "n": "Q",
                        "v": "Q"
                    },
                    {
                        "n": "R",
                        "v": "R"
                    },
                    {
                        "n": "S",
                        "v": "S"
                    },
                    {
                        "n": "T",
                        "v": "T"
                    },
                    {
                        "n": "U",
                        "v": "U"
                    },
                    {
                        "n": "V",
                        "v": "V"
                    },
                    {
                        "n": "W",
                        "v": "W"
                    },
                    {
                        "n": "X",
                        "v": "X"
                    },
                    {
                        "n": "Y",
                        "v": "Y"
                    },
                    {
                        "n": "Z",
                        "v": "Z"
                    },
                    {
                        "n": "0-9",
                        "v": "0-9"
                    }

                ]


            }

        ],

        "3": [



            {
                "key": "cateId",
                "name": "类型",
                "value": [{
                        "n": "全部",
                        "v": "3"
                    },
                    {
                        "n": "大陆综艺",
                        "v": "23"
                    },
                    {
                        "n": "日韩综艺",
                        "v": "24"
                    },
                    {
                        "n": "欧美综艺",
                        "v": "25"
                    },
                    {
                        "n": "港台综艺",
                        "v": "26"
                    }

                ]



            },

            {
                "key": "area",
                "name": "地区",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "内地",
                        "v": "内地"
                    },
                    {
                        "n": "港台",
                        "v": "港台"
                    },
                    {
                        "n": "日韩",
                        "v": "日韩"
                    },
                    {
                        "n": "欧美",
                        "v": "欧美"
                    }
                ]



            },

            {
                "key": "year",
                "name": "年份",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "2025",
                        "v": "2025"
                    },
                    {
                        "n": "2024",
                        "v": "2024"
                    },
                    {
                        "n": "2023",
                        "v": "2023"
                    },
                    {
                        "n": "2022",
                        "v": "2022"
                    },
                    {
                        "n": "2021",
                        "v": "2021"
                    },
                    {
                        "n": "2020",
                        "v": "2020"
                    },
                    {
                        "n": "2019",
                        "v": "2019"
                    },
                    {
                        "n": "2018",
                        "v": "2018"
                    },
                    {
                        "n": "2017",
                        "v": "2017"
                    },
                    {
                        "n": "2016",
                        "v": "2016"
                    },
                    {
                        "n": "2015",
                        "v": "2015"
                    }
                ]

            },


            {
                "key": "lang",
                "name": "语言",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "国语",
                        "v": "国语"
                    },
                    {
                        "n": "英语",
                        "v": "英语"
                    },
                    {
                        "n": "粤语",
                        "v": "粤语"
                    },
                    {
                        "n": "闽南语",
                        "v": "闽南语"
                    },
                    {
                        "n": "韩语",
                        "v": "韩语"
                    },
                    {
                        "n": "日语",
                        "v": "日语"
                    },
                    {
                        "n": "法语",
                        "v": "法语"
                    },
                    {
                        "n": "德语",
                        "v": "德语"
                    },
                    {
                        "n": "其它",
                        "v": "其它"
                    }
                ]

            },


            {
                "key": "letter",
                "name": "字母",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "A",
                        "v": "A"
                    },
                    {
                        "n": "B",
                        "v": "B"
                    },
                    {
                        "n": "C",
                        "v": "C"
                    },
                    {
                        "n": "D",
                        "v": "D"
                    },
                    {
                        "n": "E",
                        "v": "E"
                    },
                    {
                        "n": "F",
                        "v": "F"
                    },
                    {
                        "n": "G",
                        "v": "G"
                    },
                    {
                        "n": "H",
                        "v": "H"
                    },
                    {
                        "n": "I",
                        "v": "I"
                    },
                    {
                        "n": "J",
                        "v": "J"
                    },
                    {
                        "n": "K",
                        "v": "K"
                    },
                    {
                        "n": "L",
                        "v": "L"
                    },
                    {
                        "n": "M",
                        "v": "M"
                    },
                    {
                        "n": "N",
                        "v": "N"
                    },
                    {
                        "n": "O",
                        "v": "O"
                    },
                    {
                        "n": "P",
                        "v": "P"
                    },
                    {
                        "n": "Q",
                        "v": "Q"
                    },
                    {
                        "n": "R",
                        "v": "R"
                    },
                    {
                        "n": "S",
                        "v": "S"
                    },
                    {
                        "n": "T",
                        "v": "T"
                    },
                    {
                        "n": "U",
                        "v": "U"
                    },
                    {
                        "n": "V",
                        "v": "V"
                    },
                    {
                        "n": "W",
                        "v": "W"
                    },
                    {
                        "n": "X",
                        "v": "X"
                    },
                    {
                        "n": "Y",
                        "v": "Y"
                    },
                    {
                        "n": "Z",
                        "v": "Z"
                    },
                    {
                        "n": "0-9",
                        "v": "0-9"
                    }
                ]


            }


        ],

        "5": [

            {
                "key": "year",
                "name": "年份",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "2025",
                        "v": "2025"
                    },
                    {
                        "n": "2024",
                        "v": "2024"
                    },
                    {
                        "n": "2023",
                        "v": "2023"
                    },
                    {
                        "n": "2022",
                        "v": "2022"
                    },
                    {
                        "n": "2021",
                        "v": "2021"
                    },
                    {
                        "n": "2020",
                        "v": "2020"
                    },
                    {
                        "n": "2019",
                        "v": "2019"
                    },
                    {
                        "n": "2018",
                        "v": "2018"
                    },
                    {
                        "n": "2017",
                        "v": "2017"
                    },
                    {
                        "n": "2016",
                        "v": "2016"
                    },
                    {
                        "n": "2015",
                        "v": "2015"
                    }
                ]

            },
            {
                "key": "letter",
                "name": "字母",
                "value": [{
                        "n": "全部",
                        "v": ""
                    },
                    {
                        "n": "A",
                        "v": "A"
                    },
                    {
                        "n": "B",
                        "v": "B"
                    },
                    {
                        "n": "C",
                        "v": "C"
                    },
                    {
                        "n": "D",
                        "v": "D"
                    },
                    {
                        "n": "E",
                        "v": "E"
                    },
                    {
                        "n": "F",
                        "v": "F"
                    },
                    {
                        "n": "G",
                        "v": "G"
                    },
                    {
                        "n": "H",
                        "v": "H"
                    },
                    {
                        "n": "I",
                        "v": "I"
                    },
                    {
                        "n": "J",
                        "v": "J"
                    },
                    {
                        "n": "K",
                        "v": "K"
                    },
                    {
                        "n": "L",
                        "v": "L"
                    },
                    {
                        "n": "M",
                        "v": "M"
                    },
                    {
                        "n": "N",
                        "v": "N"
                    },
                    {
                        "n": "O",
                        "v": "O"
                    },
                    {
                        "n": "P",
                        "v": "P"
                    },
                    {
                        "n": "Q",
                        "v": "Q"
                    },
                    {
                        "n": "R",
                        "v": "R"
                    },
                    {
                        "n": "S",
                        "v": "S"
                    },
                    {
                        "n": "T",
                        "v": "T"
                    },
                    {
                        "n": "U",
                        "v": "U"
                    },
                    {
                        "n": "V",
                        "v": "V"
                    },
                    {
                        "n": "W",
                        "v": "W"
                    },
                    {
                        "n": "X",
                        "v": "X"
                    },
                    {
                        "n": "Y",
                        "v": "Y"
                    },
                    {
                        "n": "Z",
                        "v": "Z"
                    },
                    {
                        "n": "0-9",
                        "v": "0-9"
                    }
                ]


            },

        ]
    }


}